app/controllers/composers_controller.rb

SELECT * FROM "composers" WHERE ("composers"."id" = 3)
---
  def show
    @composer = Composer.find(params[:id])

INSERT INTO "composers" ("name", "created_at", "updated_at") VALUES('Bach', '2010-03-10 02:43:18', '2010-03-10 02:43:18')
---
  def create
    @composer = Composer.new(params[:composer])

    respond_to do |format|
      if @composer.save