app/controllers/performances_controller.rb

SELECT * FROM "performances"
---
  def index
    @performances = Performance.all

SELECT * FROM "performances" WHERE ("performances"."id" = 1)
---
  def show
    @performance = Performance.find(params[:id])

SELECT * FROM "performances" WHERE ("performances"."id" = 1)
---
  def edit
    @performance = Performance.find(params[:id])

INSERT INTO "performances" ("work_title", "created_at", "composer", "perform_date", "updated_at", "orchestra") VALUES('Symphony 9', '2010-02-03 01:03:09', 'Beethoven', '2009-02-03', '2010-02-03 01:03:09', 'Vienna Philharmonic')
---
  def create
    @performance = Performance.new(params[:performance])

    respond_to do |format|
      if @performance.save

SELECT * FROM "performances" WHERE ("performances"."id" = 1)
UPDATE "performances" SET "updated_at" = '2010-02-03 01:11:20', "perform_date" = '2009-02-09' WHERE "id" = 1
---
  def update
    @performance = Performance.find(params[:id])

    respond_to do |format|
      if @performance.update_attributes(params[:performance])